JacksonOvO/Software_VX_4208/Drivers/src/STM32DAC8555Driver.c
/*******************************************************************
*文件名称:  STM32AOSPIDriver.c
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/

/******************************************************************
*                             头文件                              *
******************************************************************/
#include "stm32f30x_spi.h"
#include "stm32DAC8555driver.h"
#include "stm32f30x_gpio.h"
#include "STM32GPIODriver.h"
#include "stm32f30x_rcc.h"
#include "Ioinit.h"
#include "IOOptions.h"
#include "Iocontrol.h"
#include "stm32f30x_tim.h"
#include "MasterCommunication.h"
#include "STM32F0SPIDrive.h"
#include "SEGGER_RTT.h"
#define printf(...) SEGGER_RTT_printf(0, __VA_ARGS__)

#if FR4XX4_CODE || (IO_CODE_TYPE == FR4124_CODE) || (IO_CODE_TYPE == FR4114_CODE)|| (IO_CODE_TYPE == FR4104_CODE)
/******************************************************************
*                            常量                                 *
******************************************************************/

/******************************************************************
*                           宏定义                                *
******************************************************************/

#if (IO_CODE_TYPE == FR4024_CODE) 
#define AO_MULTIPLIER   (52429)
#define AO_DIVIDEDER    (16)
#define AO_MAX_OUTPUT_DATA   (65535)
#endif

/* AO标定宏 */
#define AO_CALIBRATION_MULTIPLIER   (10737)
#define AO_CALIBRATION_DIVIDEDER    (30)


/******************************************************************
*                           数据类型                              *
******************************************************************/

/******************************************************************
*                         全局变量定义                            *
******************************************************************/
uint8_t IOLinkEventInfo[16] = {0};
// AD5755 芯片配置结构体（存储芯片工作模式参数）
AD5575_Setup AD5575_st = 
{
    0,                      // pinAD0state
    0,                      // pinAD1state
    0,                      // enablePacketErrorCheck
    1,                      // pocBit
    0,                      // statReadBit
    0,                      // shtCcLimBit
    1,                      //ewdEnable
    {0,0,0,0},           // rsetBitA, rsetBitB, rsetBitC, rsetBitD
    {0,0,0,0},           // ovrngBitA, ovrngBitB, ovrngBitC, ovrngBitD    
    0,                      // dcDcCompBit
    AD5755_PHASE_ALL_DC_DC, // dcDcPhaseBit
    AD5755_FREQ_410_HZ,     // dcDcFreqBit
    AD5755_MAX_23V          // dcDcMaxVBit
};

AD5575_Setup AD5575_st2 = 
{
    0,                      // pinAD0state
    1,                      // pinAD1state
    0,                      // enablePacketErrorCheck
    1,                      // pocBit
    0,                      // statReadBit
    0,                      // shtCcLimBit
    1,                      //ewdEnable
    {0,0,0,0},           // rsetBitA, rsetBitB, rsetBitC, rsetBitD
    {0,0,0,0},           // ovrngBitA, ovrngBitB, ovrngBitC, ovrngBitD    
    0,                      // dcDcCompBit
    AD5755_PHASE_ALL_DC_DC, // dcDcPhaseBit
    AD5755_FREQ_410_HZ,     // dcDcFreqBit
    AD5755_MAX_23V          // dcDcMaxVBit
};

    
uint8_t Rangeflags[9]={0,0,0,0,0,0,0,0,0};
uint8_t Errorflags[9]={0,0,0,0,0,0,0,0,0};

/*为使SPI能循环4通道输出并知道当前输出是哪个通道定义全局变量*/
static uint8_t gucCurrentChannel = 0;

/*组装DAC芯片4通道所需的最高8位的数据，该值是确认的，定义一个
   全局数组用于存储4通道高8位数据*/
const uint8_t DAC_HIGH_DATA[MAX_AO_CHANNEL_NUMBER] = {0x00,0x02,0x04,0x06,0x08,0x0A,0x0C,0x0E};

#if FR4XX4_CODE 
/*待发送的16位数据，全局变量声明*/
extern int16_t gusaAnalogData[MAX_AO_CHANNEL_NUMBER];
extern int16_t gusaAnalogDataMainLoop[MAX_AO_CHANNEL_NUMBER];
#endif

/* 量程定义 */
#define AI_MIN_IPUT_DATA (0x8000)
#define AI_MAX_INPUT_DATA   (0x7fff)

/*输入的码值*/
extern AODemarcate_t gtaAODemarcate[MAX_AI_CHANNEL_NUMBER];

/******************************************************************
*                          局部函数声明                            *
******************************************************************/

/******************************************************************
*                         全局函数实现                            *
******************************************************************/

void TIM7_Config(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);

    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
    TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);

    // 假设 APB1 定时器时钟 72MHz
    // 500ms 定时：72MHz / 7200 = 10kHz, 10kHz * 500 = 5000
    TIM_TimeBaseStructure.TIM_Prescaler = 7200 - 1; // 分频7200
    TIM_TimeBaseStructure.TIM_Period = 500 - 1;    // 自动重装载值
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM7, &TIM_TimeBaseStructure);

    TIM_ITConfig(TIM7, TIM_IT_Update, ENABLE); // 允许更新中断
    TIM_Cmd(TIM7, ENABLE); // 启动定时器

    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel =  TIM7_IRQn ;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

void TIM7_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM7, TIM_IT_Update) != RESET)
    {
        TIM_ClearITPendingBit(TIM7, TIM_IT_Update);

        AD5755_SetControlRegisters(AD5755_CREG_SOFT, 0, AD5755_SPI_CODE); 
    }
}


/**
 * @brief 初始化 STM32 与 DAC5755 通信
 * @details 完成 SPI 外设、GPIO 控制引脚、DAC 芯片初始化，并执行通信测试
 * @return E_STM32_AO_SPI_OK          初始化成功
 *         E_STM32_AO_SPI_TXFIFO_NOT_EMPTY  TXFIFO 非空错误
 */
STM32AOSPIDriverError_e STM32DAC5755DriverInit()
{ 


    // 初始化 SPI1 外设（配置时钟、引脚、通信模式）
    AD5755_SPI1_Init();
    
    // 初始化 DAC5755 控制引脚（LDAC、CLEAR 等 GPIO 配置）
    AD5755_GPIO_CONFIG();

    // 短延时确保 GPIO 状态稳定
    delay_us(100);
    
    // 执行 DAC5755 芯片初始化流程（复位、寄存器配置）
    AD5755_Init();
   

