JacksonOvO/Software_VX_4208/Drivers/src/STM32DAC8555Driver.c
    return E_STM32_AO_SPI_OK;
}

/******************************************************************
*函数名称:STM32DAC8555DriverOutput
*功能描述:数据输出
*输入参数:无
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/2/10                              zhanghaifeng  we015
******************************************************************/
void STM32DAC8555DriverOutput(void)
{
    /*检查全局变量gucCurrentChannel以确保一轮4个通道都输出完成*/
    if (gucCurrentChannel != CHANNEL_INITIAL_VALUE)
    {
        return;
    }
    /*调用STM32AOSPISendData函数，用于填充TXFIFO*/
    //(void)STM32AD5755SendData(gucCurrentChannel);

    /*启动定时器，设置定时器时间为20us*/
    //DiSamplingTimerInit(AO_SAMPLING_PERIOD);    
}

/******************************************************************
*                         局部函数实现                            *
******************************************************************/

/**
 * @brief 配置 AD5755 控制引脚 GPIO
 * @details 初始化 GPIOB 引脚为推挽输出，设置 LDAC=低电平、CLEAR=高电平
 */
void AD5755_GPIO_CONFIG(void)
{

    GPIO_InitTypeDef GPIOInitStruct; // GPIO 初始化结构体

    // 使能 GPIOB 时钟（LDAC/CLEAR 引脚位于 GPIOB）
    RCC_AHBPeriphClockCmd(RCC_AHBENR_GPIOBEN, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBENR_GPIOAEN, ENABLE);

    // 配置引脚模式：输出模式、推挽、50MHz 速度、无上下拉
    GPIOInitStruct.GPIO_Pin   = INDICTOR_LDAC_GPIO_PIN | INDICTOR_CLEAR_GPIO_PIN; // 组合引脚号
    GPIOInitStruct.GPIO_Mode  = GPIO_Mode_OUT;                                   // 输出模式
    GPIOInitStruct.GPIO_OType = GPIO_OType_PP;                                  // 推挽输出
    GPIOInitStruct.GPIO_Speed = GPIO_Speed_50MHz;                                // 高速模式
    GPIOInitStruct.GPIO_PuPd  = GPIO_PuPd_UP;                               // 无上下拉电阻

    // 初始化 GPIOB 相关引脚
    GPIO_Init(GPIOB, &GPIOInitStruct);

    // 设置初始电平：LDAC 低电平（禁止更新），CLEAR 低电平
    GPIO_ResetBits(GPIOB, INDICTOR_LDAC_GPIO_PIN); // LDAC = 0
    GPIO_ResetBits(GPIOB, INDICTOR_CLEAR_GPIO_PIN);  // CLEAR = 0
    
    GPIOInitStruct.GPIO_Pin   = GPIO_Pin_13;         // ALERT 引脚
    GPIOInitStruct.GPIO_Mode  = GPIO_Mode_IN;        // 输入模式
    GPIOInitStruct.GPIO_PuPd  = GPIO_PuPd_DOWN;      // 下拉（防止悬空）
    GPIO_Init(GPIOB, &GPIOInitStruct);
    
    //----------------------------------------------------------------------------//
    
        // 配置引脚模式：输出模式、推挽、50MHz 速度、无上下拉
    GPIOInitStruct.GPIO_Pin   = INDICTOR_LDAC2_GPIO_PIN | INDICTOR_CLEAR2_GPIO_PIN; // 组合引脚号
    GPIOInitStruct.GPIO_Mode  = GPIO_Mode_OUT;                                   // 输出模式
    GPIOInitStruct.GPIO_OType = GPIO_OType_PP;                                  // 推挽输出
    GPIOInitStruct.GPIO_Speed = GPIO_Speed_50MHz;                                // 高速模式
    GPIOInitStruct.GPIO_PuPd  = GPIO_PuPd_UP;                               // 无上下拉电阻

    // 初始化 GPIAB 相关引脚
    GPIO_Init(GPIOA, &GPIOInitStruct);

    // 设置初始电平：LDAC 低电平（禁止更新），CLEAR 低电平
    GPIO_ResetBits(GPIOA, INDICTOR_LDAC2_GPIO_PIN); // LDAC = 0
    GPIO_ResetBits(GPIOA, INDICTOR_CLEAR2_GPIO_PIN);  // CLEAR = 0
    
    GPIOInitStruct.GPIO_Pin   = GPIO_Pin_8;         // ALERT 引脚
    GPIOInitStruct.GPIO_Mode  = GPIO_Mode_IN;        // 输入模式
    GPIOInitStruct.GPIO_PuPd  = GPIO_PuPd_DOWN;      // 下拉（防止悬空）
    GPIO_Init(GPIOA, &GPIOInitStruct);
}

/******************************************************************
* 函数名称: AD5755_Init
* 功能描述: 初始化 AD5755 DAC 芯片
* 输入参数: 无
* 输出参数: 无
******************************************************************/
void AD5755_Init(void)
{
    unsigned char status  = 0;      // 状态码（未使用）
    unsigned char channel = 0;      // 通道计数器
    AD5575_Setup *pAD5575_st = &AD5575_st; // 配置结构体指针
    AD5575_Setup *pAD5575_st2 = &AD5575_st2; // 配置结构体指针

    // 1. 软件复位芯片
    AD5755_Software_Reset();
    delay_us(100);                  // 复位后延时（确保芯片稳定）

    // 2. 配置主控制寄存器
    AD5755_SetControlRegisters(AD5755_CREG_MAIN,
                              0,
                              (pAD5575_st->pocBit * AD5755_MAIN_POC) |         // 上电校准位
                              (pAD5575_st->statReadBit * AD5755_MAIN_STATREAD) | // 状态读取位
                              (pAD5575_st->ewdEnable * AD5755_MAIN_EWD) |
                               AD5755_MAIN_WD(AD5755_WD_200MS) |
                              AD5755_MAIN_SHTCCTLIM(pAD5575_st->shtCcLimBit));   // 短路电流限制位
    AD5755_SetControlRegisters2(AD5755_CREG_MAIN,
                              0,
                              (pAD5575_st2->pocBit * AD5755_MAIN_POC) |         // 上电校准位
                              (pAD5575_st2->statReadBit * AD5755_MAIN_STATREAD) | // 状态读取位
                              (pAD5575_st2->ewdEnable * AD5755_MAIN_EWD) |
                               AD5755_MAIN_WD(AD5755_WD_200MS) |
                              AD5755_MAIN_SHTCCTLIM(pAD5575_st2->shtCcLimBit));   // 短路电流限制位

    // 3. 启用数据包错误校验（若配置）
    if (AD5575_st.enablePacketErrorCheck)
    {
        AD5755_PEC_ENABLE();
    }
 
    // 4. 配置 DC-DC 转换器参数
    AD5755_SetControlRegisters(
          AD5755_CREG_DC_DC,
          0,
          (pAD5575_st->dcDcCompBit * AD5755_DC_DC_COMP) |       // DC-DC 补偿
          (AD5755_DC_DC_FREQ(pAD5575_st->dcDcFreqBit)) |         // 工作频率
          (AD5755_DC_DC_PHASE(pAD5575_st->dcDcPhaseBit)) |       // 相位模式
          (AD5755_DC_DC_MAX_V(pAD5575_st->dcDcMaxVBit)));        // 最大输出电压
    
    AD5755_SetControlRegisters2(
          AD5755_CREG_DC_DC,
          0,
          (pAD5575_st2->dcDcCompBit * AD5755_DC_DC_COMP) |       // DC-DC 补偿
          (AD5755_DC_DC_FREQ(pAD5575_st2->dcDcFreqBit)) |         // 工作频率
          (AD5755_DC_DC_PHASE(pAD5575_st2->dcDcPhaseBit)) |       // 相位模式
          (AD5755_DC_DC_MAX_V(pAD5575_st2->dcDcMaxVBit)));        // 最大输出电压

    // 5. 配置每个通道的 DAC 控制寄存器
    for (channel = AD5755_DAC_A; channel <= AD5755_DAC_D; channel++)
    {
 
        // 配置通道参数（内部参考、DC-DC 模式、输出范围等）
        AD5755_SetControlRegisters(AD5755_CREG_DAC,
                                   channel,
                                   pAD5575_st->rsetBits[channel] |       // 输出电阻设置
                                   pAD5575_st->ovrngBits[channel] |      // 过载范围设置
                                   AD5755_DAC_INT_ENABLE |               // 启用内部参考
                                   //AD5755_DAC_OVRNG |
                                   AD5755_DAC_DC_DC |                    // 启用 DC-DC 转换器
                                   AD5755_DAC_R(AD5755_R_0_12_V));      // 默认设置为 4-20mA 范围
        AD5755_SetControlRegisters2(AD5755_CREG_DAC,
                                   channel,
                                   pAD5575_st2->rsetBits[channel] |       // 输出电阻设置
                                   pAD5575_st2->ovrngBits[channel] |      // 过载范围设置
                                   AD5755_DAC_INT_ENABLE |               // 启用内部参考
                                   //AD5755_DAC_OVRNG |
                                   AD5755_DAC_DC_DC |                    // 启用 DC-DC 转换器
                                   AD5755_DAC_R(AD5755_R_0_12_V));      // 默认设置为 4-20mA 范围

