JacksonOvO/Software_VX_4208/Drivers/src/STM32DAC8555Driver.c
        // 设置初始输出值（0x1000 = 约 8mA，对应 4-20mA 范围的中点）
        AD5755_SetRegisterValue(AD5755_DREG_WR_DAC, channel, 0x0);
        AD5755_SetRegisterValue2(AD5755_DREG_WR_DAC, channel, 0x0);
    }

    // 6. 延时确保 DC-DC 转换器稳定（至少 200us）
    delay_us(200);

    // 7. 启用所有通道输出
    for (channel = AD5755_DAC_A; channel <= AD5755_DAC_D; channel++)
    {

        AD5755_SetControlRegisters(AD5755_CREG_DAC,
                                   channel,
                                   AD5755_DAC_INT_ENABLE |   // 启用内部参考
                                   AD5755_DAC_OUTEN |        // 启用输出
                                   //AD5755_DAC_OVRNG |
                                   AD5755_DAC_DC_DC |        // 启用 DC-DC 转换器
                                   AD5755_DAC_R(AD5755_R_0_12_V)); // 输出范围为 4-20mA
        AD5755_SetControlRegisters2(AD5755_CREG_DAC,
                                   channel,
                                   AD5755_DAC_INT_ENABLE |   // 启用内部参考
                                   AD5755_DAC_OUTEN |        // 启用输出
                                   //AD5755_DAC_OVRNG |
                                   AD5755_DAC_DC_DC |        // 启用 DC-DC 转换器
                                   AD5755_DAC_R(AD5755_R_0_12_V)); // 输出范围为 4-20mA
    }
   
    
}


/**
 * @brief  电压输出码值线性补偿
 * @param  code 原码值（电压DAC码值）
 * @return 补偿后的码值
 */
int32_t CurrentLinearCompensate(int32_t dacCode, uint8_t ucCurrentChannel)
{
    if (dacCode == 0) {
        return 0;
    }
    

    double comp = 0.0;
    double corrected = (double)dacCode;
    if (dacCode > 5000 || dacCode < -5000) {  // 支持正负值
        if(AISampleType[ucCurrentChannel] == 0x01 || 
           AISampleType[ucCurrentChannel] == 0x03 || 
           AISampleType[ucCurrentChannel] == 0x05 || 
           AISampleType[ucCurrentChannel] == 0x07 )
        {  
          
          if(ucCurrentChannel < 4 ){
              comp = ((double)dacCode / 27648.0) * (13.0+gtaAODemarcate[ucCurrentChannel].lCompensateValue);
          }else{
              comp = ((double)dacCode / 27648.0) * (13.0+gtaAODemarcate[ucCurrentChannel].lCompensateValue2);
          }
          
        } else {
          double scale = 32000.0 / 27648.0;
          if(ucCurrentChannel < 4 ){
              comp = ((double)dacCode / 32000.0) *  (13.0+gtaAODemarcate[ucCurrentChannel].lCompensateValue) * scale;
          }else{
              comp = ((double)dacCode / 32000.0) *  (13.0+gtaAODemarcate[ucCurrentChannel].lCompensateValue2) * scale;
          }    
        }
    }
    
    //printf("lCompensateValue=%d\n",gtaAODemarcate[ucCurrentChannel].lCompensateValue);

    // 再加上公式里的线性补偿
    corrected += comp;

    if (corrected > 65535.0) corrected = 65535.0;
    if (corrected < -65535.0) corrected = -65535.0;

    return (int32_t)(corrected + (corrected >= 0 ? 0.5 : -0.5)); // 四舍五入，兼容负数
}

int32_t CurrentLinearCompensate_mA(int32_t dacCode,uint8_t ucCurrentChannel)
{
    if (dacCode == 0) {
        return 0;  // 零点不补偿
    }

    double comp = 0.0;
    double corrected = (double)dacCode;

    if (AISampleType[ucCurrentChannel] == 9 || AISampleType[ucCurrentChannel] == 11) {
        // 0~27648 对应 0~20mA 或 4~20mA
      if(ucCurrentChannel< 4){
        comp = ( (double)dacCode / 27648.0 ) * (16.0+gtaAODemarcate[ucCurrentChannel+4].lCompensateValue) + 13.0;  
      }else{
        comp = ( (double)dacCode / 27648.0 ) * (16.0+gtaAODemarcate[ucCurrentChannel+4].lCompensateValue2) + 13.0;  
      }
    } else {
        // 0~32000 对应 0~20mA 或 4~20mA
        double scale = 32000.0 / 27648.0;  // 基准比值 ≈ 1.157
         if(ucCurrentChannel< 4){
            comp = (( (double)dacCode / 32000.0 ) * (16.0+gtaAODemarcate[ucCurrentChannel+4].lCompensateValue) + 13.0) * scale;
         }else{
            comp = (( (double)dacCode / 32000.0 ) * (16.0+gtaAODemarcate[ucCurrentChannel+4].lCompensateValue2) + 13.0) * scale;
         }
    }

    // 如果 lCompensateValue 单位是 "码值补偿"
    //corrected += gtaAODemarcate[ucCurrentChannel+4].lCompensateValue;

    // 再加上公式里的线性补偿
    corrected += comp;

    // 限制范围（电流模式一般不会超过逻辑范围）
    if (corrected > 65535.0) corrected = 32000.0;
    if (corrected < 0.0) corrected = 0.0;

    return (int32_t)(corrected + 0.5); // 四舍五入
}


/******************************************************************
*函数名称:STM32AD5755SendData
*功能描述:填充TXFIFO
*输入参数:无
*输出参数:
*返回值:E_STM32_AO_SPI_OK                                     SPI成功
                        E_STM32_AO_SPI_TXFIFO_NOT_EMPTY        TXFIFO不为空
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/2/10                              zhanghaifeng  we015
******************************************************************/
STM32AOSPIDriverError_e STM32AD5755SendData(uint8_t ucCurrentChannel)
{
  if(RangeSwitchingFlagBit == 0)
    {
    int32_t userCode = gusaAnalogDataMainLoop[ucCurrentChannel];
//    if(gusaAnalogData[4] == 0x01){
//      //printf("AAA\n");
//      if(AIChannelSet[ucCurrentChannel] == 0x00){
//        userCode = gusaAnalogDataMainLoop[ucCurrentChannel];
//        //printf("gusaAnalogDataMainLoop[%d]=%d\n",ucCurrentChannel,gusaAnalogDataMainLoop[ucCurrentChannel]);
//      }else if(AIChannelSet[ucCurrentChannel] == 0x01){
//        userCode = 0 ;
//      }else{
//        userCode = AIValue[ucCurrentChannel];
//      }
//    }
    int32_t logicMin = 0, logicMax = 0;
    int32_t lower  = 0, Upper  = 0;
    float userMin = 0.0f, userMax = 0.0f;     // 用户定义的物理电压或电流范围
    float adcMin = 0.0f, adcMax = 0.0f;       // AD5755 实际输出电压电流范围
    float unitValue = 0.0f;
    uint16_t dacCode = 0;
    int16_t NEWCode = 0;
    AD5575_Setup *pAD5575_st = &AD5575_st; // 配置结构体指针

    
   switch (AISampleType[ucCurrentChannel])
    {
        case 0x01:  // 0~10V, 0~27648 → ADC: 0~12V
            logicMin = 0; logicMax = 27648;
            lower = 0; Upper = 32767;
            userMin = 0.0f; userMax = 10.0f;
            adcMin = 0.0f;  adcMax = 12.0f;
            if(userCode>=32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x02:  // 0~10V, 0~32000 → ADC: 0~12V
            logicMin = 0; logicMax = 32000;
            lower = 0; Upper = 32767;
            userMin = 0.0f; userMax = 10.0f;
            adcMin = 0.0f;  adcMax = 12.0f;
            if(userCode>=32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x03:  // -10V~10V, -27648~27648 → ADC: -12V~12V
            logicMin = -27648; logicMax = 27648;
            lower = -32767; Upper = 32767;
            userMin = -10.0f; userMax = 10.0f;
            adcMin = -12.0f;  adcMax = 12.0f;
            if(userCode>=32511||userCode<=-32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x04:  // -10V~10V, -32000~32000 → ADC: -12V~12V
            logicMin = -32000; logicMax = 32000;
            lower = -32767; Upper = 32767;
            userMin = -10.0f; userMax = 10.0f;
            adcMin = -12.0f;  adcMax = 12.0f;
            if(userCode>=32511||userCode<=-32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x05:  // 0V~5V, 0~27648 → ADC: 0V~6V
            logicMin = 0; logicMax = 27648;
            lower = 0; Upper = 32767;
            userMin = 0.0f; userMax = 5.0f;
            adcMin = 0.0f;  adcMax = 6.0f;
            if(userCode>=32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x06:  // 0V~5V, 0~32000 → ADC: 0V~6V
            logicMin = 0; logicMax = 32000;
            lower = 0; Upper = 32767;
            userMin = 0.0f; userMax = 5.0f;
            adcMin = 0.0f;  adcMax = 6.0f;
            if(userCode>=32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x07:  // -5V~5V, -27648~27648 → ADC: -6V~6V
            logicMin = -27648; logicMax = 27648;
            lower = -32767; Upper = 32767;
            userMin = -5.0f; userMax = 5.0f;
            adcMin = -6.0f;  adcMax = 6.0f;
            if(userCode>=32511||userCode<=-32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x08:  // -5V~5V, -32000~32000 → ADC: -6V~6V
            logicMin = -32000; logicMax = 32000;
            lower = -32767; Upper = 32767;
            userMin = -5.0f; userMax = 5.0f;
            adcMin = -6.0f;  adcMax = 6.0f;
            if(userCode>=32511||userCode<=-32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x09:  // 0~20mA, 0~27648 → ADC: 0~24mA
            logicMin = 0; logicMax = 27648;
            lower = 0; Upper = 32767;
            userMin = 0.0f; userMax = 20.0f;
            adcMin = 0.0f;  adcMax = 24.0f;
            if(userCode>=32511||userCode<=-32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x0A:  // 0~20mA, 0~32000 → ADC: 0~24mA
            logicMin = 0; logicMax = 32000;
            lower = 0; Upper = 32767;
            userMin = 0.0f; userMax = 20.0f;
            adcMin = 0.0f;  adcMax = 24.0f;
            if(userCode>=32511||userCode<=-32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x0B:  // 4~20mA, 0~27648 → ADC: 0~24mA
            logicMin = 0; logicMax = 27648;
            lower = 0; Upper = 32767;
            userMin = 4.0f; userMax = 20.0f;
            adcMin = 0.0f;  adcMax = 24.0f;
            if(userCode>=32511||userCode<=-32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        case 0x0C:  // 4~20mA, 0~32000 → ADC: 0~24mA
            logicMin = 0; logicMax = 32000;
            lower = 0; Upper = 32767;
            userMin = 4.0f; userMax = 20.0f;
            adcMin = 0.0f;  adcMax = 24.0f;
            if(userCode>=32511||userCode<=-32511){
              Rangeflags[ucCurrentChannel]=1;
            }else{
              Rangeflags[ucCurrentChannel]=0;
            }
            break;
        default:
            return E_STM32_AO_SPI_TXFIFO_NOT_EMPTY;
    }
   
   // 限制用户输入在合法范围
    if (userCode < lower) userCode = lower;
    if (userCode > Upper) userCode = Upper;

     
    if(AISampleType[ucCurrentChannel] == 9 ||AISampleType[ucCurrentChannel] == 10 ||AISampleType[ucCurrentChannel] == 11 || AISampleType[ucCurrentChannel] == 12 )
    {

      NEWCode = CurrentLinearCompensate_mA(userCode,ucCurrentChannel);
      float ratio = (float)(NEWCode - logicMin) / (logicMax - logicMin);
      unitValue = userMin + ratio * (userMax - userMin);
    }else{
      NEWCode = CurrentLinearCompensate(userCode,ucCurrentChannel);
      float ratio = (float)(NEWCode - logicMin) / (logicMax - logicMin);
      unitValue = userMin + ratio * (userMax - userMin);
      
