JacksonOvO/Software_VX_4208/Drivers/src/STM32DAC8555Driver.c
    }
    
        // 步骤2：将目标值换算为 DAC 码值
    dacCode = (uint16_t)((((unitValue - adcMin) / (adcMax - adcMin)) * 65535.0f) + 0.5f);
    
    //printf("channel:%d,mode:%d,uservalue:%d,unitValue: %d.%02d,dacCode:%d newcode:%d\n",ucCurrentChannel,AISampleType[ucCurrentChannel],userCode,(int)unitValue,(int)((unitValue - (int)unitValue) * 100),dacCode,NEWCode);
    
    if (dacCode > 65535) dacCode = 65535;    
        
    if(ucCurrentChannel<4){
        AD5755_SetRegisterValue(AD5755_DREG_WR_DAC, ucCurrentChannel, dacCode);
    }else{
        AD5755_SetRegisterValue2(AD5755_DREG_WR_DAC, ucCurrentChannel-4, dacCode);
    }    
    
    }

    return E_STM32_AO_SPI_OK;
}


/******************************************************************
*函数名称:TIM2_IRQHandler
*功能描述:定时器中断
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/2/10                              zhanghaifeng  we015
******************************************************************/
#if FR4XX4_CODE|| (IO_CODE_TYPE == FR4124_CODE) || (IO_CODE_TYPE == FR4114_CODE)||(IO_CODE_TYPE == FR4104_CODE)
void TIM2_IRQHandler(void)
{        
    /* Disable timer 2 */
    TIM_Cmd(TIM2, DISABLE);
    
    if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)
    {
        /* 清除中断 */
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);

        if (SPI_I2S_GetFlagStatus(DAC_SPI, SPI_I2S_FLAG_BSY) == RESET)
        {
            /*输出时配置SYNC为高，没有输出时配置为低
                    (备注:本次硬件版本是输出时SYNC为高，实际输出时SYNC应为低)*/


            /*准备进行下个通道输出，当前发送通道全局变量加1*/
            gucCurrentChannel++;
            if(AO_CYCLE_TIMES == gucCurrentChannel)
            {
                gucCurrentChannel = CHANNEL_INITIAL_VALUE;
                return;
            }
            
            /*调用STM32AOSPISendData函数实现DAC4通道输出*/
            //(void)STM32AD5755SendData(gucCurrentChannel);        
        }
    }
    /* Enable timer 2 */
    TIM_Cmd( TIM2, ENABLE );
}
#endif

/******************************************************************
* 函数名称: AD5755_SetVoltage
* 功能描述: 设置指定通道的电压输出值
* 输入参数: channel - 通道号（0~3）
*           voltage - 目标电压值（单位：V）
* 输出参数: 实际输出电压值（浮点型，带校准后结果）
******************************************************************/
float AD5755_SetVoltage(unsigned char channel, float voltage)
{
  
    unsigned long code        = 0;
    unsigned char range       = 0;
    unsigned char resolution  = 0;
    unsigned long rangeOffset = 0;
    float         vRef        = 0;
    float         realVoltage = 0;
    
    /* Get the range of the selected channel. */
    range = AD5755_GetRegisterValue(AD5755_RD_CTRL_REG(channel)) & 0x7;
    switch(range)
    {
        case AD5755_R_0_5_V:
            rangeOffset = 0;
            vRef = 5.0;
            resolution = 16;
            break;
        case AD5755_R_0_10_V:
            rangeOffset = 0;
            vRef = 10.0;
            resolution = 16;
            break;
        case AD5755_R_M5_P5_V:
            rangeOffset = 0x8000;
            vRef = 5.0;
            resolution = 15;
            break;
        case AD5755_R_M10_P10_V:
            rangeOffset = 0x8000;
            vRef = 10.0;
            resolution = 15;
            break;
        default:
            rangeOffset = 0;
            vRef = 0;
            resolution = 0;
    }
    
    /* Compute the binary code from the users voltage value. */
    code = (long)(voltage * (1l << resolution) / vRef) + rangeOffset;
    if(code > 0xFFFF)
    {
        code = 0xFFFF;
    }
    
    // 写入 DAC 数据寄存器
    AD5755_SetRegisterValue(AD5755_DREG_WR_DAC, channel, code);
    
    // 计算实际输出电压（用于返回校准后的值）
    realVoltage = ((long)(code - rangeOffset) * vRef) / (1l << resolution);
        
    return realVoltage;
}

float AD5755_SetCurrent(unsigned char channel, float mACurrent)
{
  printf("AD5755_SetCurrent\n");
    long  range       = 0;
    long  code        = 0;
    char  rangeOffset = 0;
    float iRef        = 0;
    float realCurrent = 0;
    
    /* Get the range of the selected channel. */
    range = AD5755_GetRegisterValue(AD5755_RD_CTRL_REG(channel)) & 0x7;
    switch(range)
    {
        case AD5755_R_4_20_MA:
            iRef = 16.0;        // mA
            rangeOffset = 4;    // mA
            break;
        case AD5755_R_0_20_MA:
            iRef = 20.0;        // mA
            rangeOffset = 0;    // mA
            break;
        case AD5755_R_0_24_MA:
            iRef = 24.0;        // mA
            rangeOffset = 0;    // mA
            break;
        default:
            iRef = 1;
            rangeOffset = 0;
    }
    
    /* Compute the binary code from the value(mA) provided by user. */
    code = (long)((mACurrent - rangeOffset) * (1l << 16) / iRef);
    if(code > 0xFFFF)
    {
        code = 0xFFFF;
    }

    /* Write to the Data Register of the DAC. */
    AD5755_SetRegisterValue(AD5755_DREG_WR_DAC,
                            channel,
                            code);
    
    realCurrent = (code * iRef / (float)(1l << 16)) + rangeOffset;
    
    return realCurrent;
}

/******************************************************************
* 函数名称: AD5755_SetRegisterValue
* 功能描述: 向 DAC 寄存器写入数据
* 输入参数: registerAddress - 寄存器地址
*           channel         - 目标通道号
*           registerValue   - 写入值（32位）
* 输出参数: 状态寄存器值（通信结果）
******************************************************************/
unsigned short AD5755_SetRegisterValue(unsigned char registerAddress,
                                       unsigned char channel,
                                       unsigned long registerValue)
{

    unsigned char  buff[4]   = {0, 0, 0, 0}; // 传输缓冲区
    unsigned long  command   = 0;            // 命令字
    unsigned short statusReg = 0;            // 状态寄存器值
 
    // 构建写寄存器命令（包含地址、通道、数据等信息）
    command = AD5755_ISR_WRITE | 
              AD5755_ISR_DUT_AD1(AD5575_st.pinAD1state) | 
              AD5755_ISR_DUT_AD0(AD5575_st.pinAD0state) |
              AD5755_ISR_DREG(registerAddress) | 
              AD5755_ISR_DAC_AD(channel) |
              AD5755_ISR_DATA(registerValue);

    // 拆分命令字为3字节（高位在前）
    buff[0] = (command & 0xFF0000) >> 16;
    buff[1] = (command & 0x00FF00) >> 8;
    buff[2] = (command & 0x0000FF) >> 0;    

