JacksonOvO/Software_VX_4208/Drivers/src/STM32DAC8555Driver.c
    // 若启用 CRC 校验，计算并添加校验字节
    if (AD5575_st.enablePacketErrorCheck)
    {
        buff[3] = AD5755_CheckCrc(buff, 3);
    }

    // 通过 SPI 发送数据（包含 CRC 校验字节）
    SPI_Write(AD5755_SLAVE_ID, buff, 3 + AD5575_st.enablePacketErrorCheck);  

    return statusReg; // 返回状态寄存器（当前未实际读取，返回0）
}

/******************************************************************
* 函数名称: AD5755_SetRegisterValue
* 功能描述: 向 DAC 寄存器写入数据
* 输入参数: registerAddress - 寄存器地址
*           channel         - 目标通道号
*           registerValue   - 写入值（32位）
* 输出参数: 状态寄存器值（通信结果）
******************************************************************/
unsigned short AD5755_SetRegisterValue2(unsigned char registerAddress,
                                       unsigned char channel,
                                       unsigned long registerValue)
{

    unsigned char  buff[4]   = {0, 0, 0, 0}; // 传输缓冲区
    unsigned long  command   = 0;            // 命令字
    unsigned short statusReg = 0;            // 状态寄存器值
 
    // 构建写寄存器命令（包含地址、通道、数据等信息）
    command = AD5755_ISR_WRITE | 
              AD5755_ISR_DUT_AD1(AD5575_st2.pinAD1state) | 
              AD5755_ISR_DUT_AD0(AD5575_st2.pinAD0state) |
              AD5755_ISR_DREG(registerAddress) | 
              AD5755_ISR_DAC_AD(channel) |
              AD5755_ISR_DATA(registerValue);

    // 拆分命令字为3字节（高位在前）
    buff[0] = (command & 0xFF0000) >> 16;
    buff[1] = (command & 0x00FF00) >> 8;
    buff[2] = (command & 0x0000FF) >> 0;    

    // 若启用 CRC 校验，计算并添加校验字节
    if (AD5575_st.enablePacketErrorCheck)
    {
        buff[3] = AD5755_CheckCrc(buff, 3);
    }

    // 通过 SPI 发送数据（包含 CRC 校验字节）
    SPI_Write(AD5755_SLAVE_ID, buff, 3 + AD5575_st.enablePacketErrorCheck);

    return statusReg; // 返回状态寄存器（当前未实际读取，返回0）
}

/******************************************************************
* 函数名称: AD5755_CheckCrc
* 功能描述: 计算 CRC8 校验值
* 输入参数: data        - 数据缓冲区
*           bytesNumber - 数据字节数
* 输出参数: CRC8 校验值
******************************************************************/
unsigned char AD5755_CheckCrc(unsigned char* data, unsigned char bytesNumber)
{
    unsigned char crc  = 0x00; // 校验值初始化为0
    unsigned char byte = 0;    // 当前字节索引
    unsigned char bit  = 0;    // 当前位索引

    // CRC8 计算算法（多项式：0x07）
    for (byte = 0; byte < bytesNumber; byte++)
    {
        crc ^= (data[byte]); // 异或当前字节
        for (bit = 8; bit > 0; bit--)
        {
            if (crc & 0x80) // 最高位为1时，应用多项式除法
            {
                crc = (crc << 1) ^ AD5755_CRC_POLYNOMIAL;
            }
            else // 最高位为0时，直接左移
            {
                crc = (crc << 1);
            }
        }
    }
    return crc; // 返回计算得到的 CRC 校验值
}

/******************************************************************
* 函数名称: delay_us
* 功能描述: 微秒级延时函数（基于空操作循环）
* 输入参数: us - 延时微秒数
* 输出参数: 无
* 注意事项: 需根据实际 MCU 主频调整循环系数
******************************************************************/
void delay_us(uint32_t us)
{
    us *= 72;  // 循环系数（需根据 MCU 主频调整）
    while (us--) __NOP();  // 空操作循环实现延时
}

void delay_ms(uint32_t ms)
{
    ms *= 72000;  // 循环系数（STM32F302C8主频为72MHz）
    while (ms--) __NOP();  // 空操作循环实现延时
}


/******************************************************************
* 函数名称: AD5755_Software_Reset
* 功能描述: 软件复位 AD5755 芯片
* 输入参数: 无
* 输出参数: 无
******************************************************************/
void AD5755_Software_Reset(void)
{
    // 向软件控制寄存器写入复位命令（0xFFFF）
    AD5755_SetControlRegisters(AD5755_CREG_SOFT, 0, AD5755_RESET_CODE);
    AD5755_SetControlRegisters2(AD5755_CREG_SOFT, 0, AD5755_RESET_CODE);
}

/******************************************************************
* 函数名称: AD5755_SetControlRegisters
* 功能描述: 设置 AD5755 控制寄存器
* 输入参数: ctrlRegAddress - 控制寄存器地址
*           channel        - 目标通道
*           regValue       - 寄存器值
* 输出参数: 无
******************************************************************/
void AD5755_SetControlRegisters(unsigned char  ctrlRegAddress,
                                unsigned char  channel,
                                unsigned short regValue)
{
    // 调用寄存器写入函数，写入控制寄存器
    AD5755_SetRegisterValue(AD5755_DREG_WR_CTRL_REG, 
                            channel,
                            AD5755_CTRL_CREG(ctrlRegAddress) | regValue);
}

void AD5755_SetControlRegisters2(unsigned char  ctrlRegAddress,
                                unsigned char  channel,
                                unsigned short regValue)
{
    // 调用寄存器写入函数，写入控制寄存器
    AD5755_SetRegisterValue2(AD5755_DREG_WR_CTRL_REG, 
                            channel,
                            AD5755_CTRL_CREG(ctrlRegAddress) | regValue);
}
/******************************************************************
* 函数名称: AD5755_PEC_ENABLE
* 功能描述: 启用数据包错误校验（PEC）
* 输入参数: 无
* 输出参数: 无
******************************************************************/
void AD5755_PEC_ENABLE(void)
{
    // 向软件控制寄存器写入 PEC 启用命令（位12置1）
    AD5755_SetControlRegisters(AD5755_CREG_SOFT, 0, 1 << 12);
}

/******************************************************************
* 函数名称: AD5755_GetRegisterValue
* 功能描述: 读取 AD5755 寄存器值
* 输入参数: registerAddress - 寄存器地址
* 输出参数: 寄存器值（32位）
******************************************************************/
long AD5755_GetRegisterValue(unsigned char registerAddress)
{

    unsigned char buffer[4] = {0, 0, 0, 0};
    unsigned long command   = 0;
    unsigned long regValue  = 0;
    unsigned char crc       = 0;
    
    command = AD5755_ISR_READ | 
              AD5755_ISR_DUT_AD1(AD5575_st.pinAD1state) | 
              AD5755_ISR_DUT_AD0(AD5575_st.pinAD0state) | 
              AD5755_ISR_RD(registerAddress);
    buffer[0] = (command & 0xFF0000) >> 16;
    buffer[1] = (command & 0x00FF00) >> 8;
    buffer[2] = (command & 0x0000FF) >> 0;
    if(AD5575_st.enablePacketErrorCheck)
    {
        buffer[3] = AD5755_CheckCrc(buffer, 3);
    }
    SPI_Write(AD5755_SLAVE_ID, buffer, 3 + AD5575_st.enablePacketErrorCheck);
    command = AD5755_ISR_WRITE | 
              AD5755_ISR_DUT_AD1(AD5575_st.pinAD1state) | 
              AD5755_ISR_DUT_AD0(AD5575_st.pinAD0state) |
              AD5755_ISR_NOP;
    buffer[0] = (command & 0xFF0000) >> 16;
    buffer[1] = (command & 0x00FF00) >> 8;
    buffer[2] = (command & 0x0000FF) >> 0;
    if(AD5575_st.enablePacketErrorCheck)
    {
        buffer[3] = AD5755_CheckCrc(buffer, 3);
    }
    SPI_Read(AD5755_SLAVE_ID, buffer, 3 + AD5575_st.enablePacketErrorCheck);
    regValue = ((unsigned short)buffer[1] << 8) + buffer[2];
    /* Check the CRC. */
    if(AD5575_st.enablePacketErrorCheck)
    {
        crc = AD5755_CheckCrc(&buffer[1], 3);
        if(crc != AD5755_CRC_CHECK_CODE)
        {
            regValue = -1;
        }
    }
    
    return regValue;
}

/******************************************************************
* 函数名称: AD5755_GetRegisterValue2
* 功能描述: 读取 AD5755 寄存器值
* 输入参数: registerAddress - 寄存器地址
* 输出参数: 寄存器值（32位）
******************************************************************/
long AD5755_GetRegisterValue2(unsigned char registerAddress)
{

    unsigned char buffer[4] = {0, 0, 0, 0};
    unsigned long command   = 0;
    unsigned long regValue  = 0;
    unsigned char crc       = 0;
    
    command = AD5755_ISR_READ | 
              AD5755_ISR_DUT_AD1(AD5575_st2.pinAD1state) | 
              AD5755_ISR_DUT_AD0(AD5575_st2.pinAD0state) | 
              AD5755_ISR_RD(registerAddress);
    buffer[0] = (command & 0xFF0000) >> 16;
    buffer[1] = (command & 0x00FF00) >> 8;
    buffer[2] = (command & 0x0000FF) >> 0;
    if(AD5575_st2.enablePacketErrorCheck)
    {
        buffer[3] = AD5755_CheckCrc(buffer, 3);
    }
    SPI_Write(AD5755_SLAVE_ID, buffer, 3 + AD5575_st2.enablePacketErrorCheck);
    command = AD5755_ISR_WRITE | 
              AD5755_ISR_DUT_AD1(AD5575_st2.pinAD1state) | 
              AD5755_ISR_DUT_AD0(AD5575_st2.pinAD0state) |
              AD5755_ISR_NOP;
    buffer[0] = (command & 0xFF0000) >> 16;
    buffer[1] = (command & 0x00FF00) >> 8;
    buffer[2] = (command & 0x0000FF) >> 0;
    if(AD5575_st2.enablePacketErrorCheck)
    {
        buffer[3] = AD5755_CheckCrc(buffer, 3);
    }
    SPI_Read(AD5755_SLAVE_ID, buffer, 3 + AD5575_st2.enablePacketErrorCheck);
    regValue = ((unsigned short)buffer[1] << 8) + buffer[2];
    /* Check the CRC. */
    if(AD5575_st2.enablePacketErrorCheck)
    {
        crc = AD5755_CheckCrc(&buffer[1], 3);
        if(crc != AD5755_CRC_CHECK_CODE)
        {
            regValue = -1;
        }
    }
    
    return regValue;
}


void AD5755_SetChannelRange(unsigned char channel, unsigned char range)
{
  printf("AD5755_SetChannelRange\n");
    unsigned short outputCode = 0x0000;
    unsigned long  oldDacCtrlReg = 0;
    unsigned long  newDacCtrlReg = 0;
    
    /* Read the content of the DAC Control Register of the selected channel. */
    oldDacCtrlReg = AD5755_GetRegisterValue(AD5755_RD_CTRL_REG(channel));
    /* Clear the bits that will be modified by this function. */
    oldDacCtrlReg &= ~(AD5755_DAC_INT_ENABLE | 
                       AD5755_DAC_OUTEN | 
                       AD5755_DAC_DC_DC | 
                       AD5755_DAC_R(7));
    /* Select the output code before changing the range. */
    if((range == AD5755_R_M5_P5_V) || (range == AD5755_R_M10_P10_V))
    {
        outputCode = 0x8000;
    }
    /* Set the output code to zero or midscale. */
    AD5755_SetRegisterValue(AD5755_DREG_WR_DAC, channel, outputCode);
    /* Set range. */
    newDacCtrlReg = oldDacCtrlReg | 
                    AD5755_DAC_INT_ENABLE | 
                    AD5755_DAC_DC_DC | 
                    AD5755_DAC_R(range);
    AD5755_SetControlRegisters(AD5755_CREG_DAC, channel, newDacCtrlReg);
    /* Set the output code to zero or midscale. */
    AD5755_SetRegisterValue(AD5755_DREG_WR_DAC, channel, outputCode);
    delay_us(200);
    /* Enable the output of the channel. */
    newDacCtrlReg |= AD5755_DAC_OUTEN;
    AD5755_SetControlRegisters(AD5755_CREG_DAC, channel, newDacCtrlReg);
}

void AD5755_ChannelClearEnable(unsigned char channel, unsigned char clearEn)
{
    printf("AD5755_ChannelClearEnable\n");
    unsigned long  oldDacCtrlReg = 0;
    unsigned long  newDacCtrlReg = 0;
    
    /* Read the content of the DAC Control Register of the selected channel. */
    oldDacCtrlReg = AD5755_GetRegisterValue(AD5755_RD_CTRL_REG(channel));
    /* Clear the CLR_EN bit. */
    oldDacCtrlReg &= ~(AD5755_DAC_CLR_EN);
    newDacCtrlReg |= oldDacCtrlReg | (clearEn * AD5755_DAC_CLR_EN);
    AD5755_SetControlRegisters(AD5755_CREG_DAC, channel, newDacCtrlReg);
}

void AD5755_ParseStatusRegister(void) 
{
    // 状态寄存器地址，根据之前结论填 0x18
    const unsigned char statusRegAddr = 0x18; 
    
    uint8_t byte0 = 0;
    uint8_t byte1 = 0;
    
