JacksonOvO/Software_VX_4208/Drivers/src/STM32DAC8555Driver.c
    long statusValue = AD5755_GetRegisterValue(statusRegAddr);
    Errorflags[0]=0;
    Errorflags[1]=0;
    Errorflags[2]=0;
    Errorflags[3]=0;
    Errorflags[4]=0;
    Errorflags[5]=0;
    Errorflags[6]=0;
    Errorflags[7]=0;
    Errorflags[8]=0;
    uint8_t faultState = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_13);
    //printf("status raw=0x%08lX\n", statusValue);
    if (faultState == Bit_SET) {
        // 发生故障，开启灯闪烁
        Errorflags[4]=1;
        byte1 |= (1<<2);
    } else {
        // 正常，关闭闪烁或常亮
        Errorflags[4]=0;
        byte1 |= (0<<2);
    }
    
    // 逐位解析状态寄存器，根据表格定义判断故障
    // DC-DCD 故障（Bit15）
    if (statusValue & (1 << 15)) {
        printf("DC-DC D ERR\n");
        Rangeflags[3]=1;
    }
    // DC-DCC 故障（Bit14）
    if (statusValue & (1 << 14)) {
        printf("DC-DC C ERR\n");
        Rangeflags[2]=1;
    }
    // DC-DCB 故障（Bit13）
    if (statusValue & (1 << 13)) {
        printf("DC-DC B ERR\n");
        Rangeflags[1]=1;
    }
    // DC-DCA 故障（Bit12）
    if (statusValue & (1 << 12)) {
        printf("DC-DC A ERR\n");
        Rangeflags[0]=1;
    }
    // 用户切换（Bit11）
    if (statusValue & (1 << 11)) {
        
    }
    // PEC 错误（Bit10）
    if (statusValue & (1 << 10)) {
        printf("PECERR\n");
    }
    // 斜坡有效（Bit9）
    if (statusValue & (1 << 9)) {
       
    }
    // 过热（Bit8）
    if (statusValue & (1 << 8)) {
        //printf("Overheating\n");
        byte1 |= (1<<1);
    }
    // VOUT_D 故障（Bit7）
    if (statusValue & (1 << 7)) {
        //printf("VOUT_D ERROR\n");
        Rangeflags[3]=1;
        byte0 |= (1<<7);
    }
    // VOUT_C 故障（Bit6）
    if (statusValue & (1 << 6)) {
        //printf("VOUT_C ERROR\n");
        Rangeflags[2]=1;
        byte0 |= (1<<6);
    }
    // VOUT_B 故障（Bit5）
    if (statusValue & (1 << 5)) {
        //printf("VOUT_B ERROR\n");
        Rangeflags[1]=1;
        byte0 |= (1<<5);
    }
    // VOUT_A 故障（Bit4）
    if (statusValue & (1 << 4)) {
        //printf("VOUT_A ERROR\n");
        Rangeflags[0]=1;
        byte0 |= (1<<4);
    }
    // IOUT_D 故障（Bit3）
    if (statusValue & (1 << 3)) {
        //printf("IOUT_D ERR\n");
        Rangeflags[3]=1;
        byte0 |= (1<<3);
    }
    // IOUT_C 故障（Bit2）
    if (statusValue & (1 << 2)) {
        //printf("IOUT_C ERR\n");
        Rangeflags[2]=1;
        byte0 |= (1<<2);
    }
    // IOUT_B 故障（Bit1）
    if (statusValue & (1 << 1)) {
        //printf("IOUT_B ERR\n");
        Rangeflags[1]=1;
        byte0 |= (1<<1);
    }
    // IOUT_A 故障（Bit0）
    if (statusValue & (1 << 0)) {
        //printf("IOUT_A ERR\n");
        Rangeflags[0]=1;
        byte0 |= (1<<0);
    }
    
    IOLinkEventInfo[0] = byte0;
    IOLinkEventInfo[1] = byte1;
}

void AD5755_ParseStatusRegister2(void) 
{
    // 状态寄存器地址，根据之前结论填 0x18
    const unsigned char statusRegAddr = 0x18; 
    
    uint8_t byte0 = 0;
    uint8_t byte1 = 0;
    
    long statusValue = AD5755_GetRegisterValue2(statusRegAddr);
    Errorflags[0]=0;
    Errorflags[1]=0;
    Errorflags[2]=0;
    Errorflags[3]=0;
    Errorflags[4]=0;
    Errorflags[5]=0;
    Errorflags[6]=0;
    Errorflags[7]=0;
    Errorflags[8]=0;
                    
    uint8_t faultState = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8);
    //printf("status raw=0x%08lX\n", statusValue);
    if (faultState == Bit_SET) {
        // 发生故障，开启灯闪烁
        Errorflags[8]=1;
        byte1 |= (1<<2);
    } else {
        // 正常，关闭闪烁或常亮
        Errorflags[8]=0;
        byte1 |= (0<<2);
    }
    
    // 逐位解析状态寄存器，根据表格定义判断故障
    // DC-DCD 故障（Bit15）
    if (statusValue & (1 << 15)) {
        printf("DC-DC D ERR\n");
        Rangeflags[7]=1;
    }
    // DC-DCC 故障（Bit14）
    if (statusValue & (1 << 14)) {
        printf("DC-DC C ERR\n");
        Rangeflags[6]=1;
    }
    // DC-DCB 故障（Bit13）
    if (statusValue & (1 << 13)) {
        printf("DC-DC B ERR\n");
        Rangeflags[5]=1;
    }
    // DC-DCA 故障（Bit12）
    if (statusValue & (1 << 12)) {
        printf("DC-DC A ERR\n");
        Rangeflags[4]=1;
    }
    // 用户切换（Bit11）
    if (statusValue & (1 << 11)) {
        
    }
    // PEC 错误（Bit10）
    if (statusValue & (1 << 10)) {
        printf("PECERR\n");
    }
    // 斜坡有效（Bit9）
    if (statusValue & (1 << 9)) {
       
    }
    // 过热（Bit8）
    if (statusValue & (1 << 8)) {
        //printf("Overheating\n");
        byte1 |= (1<<1);
    }
    // VOUT_D 故障（Bit7）
    if (statusValue & (1 << 7)) {
        //printf("VOUT_D ERROR\n");
        Rangeflags[7]=1;
        byte0 |= (1<<7);
    }
    // VOUT_C 故障（Bit6）
    if (statusValue & (1 << 6)) {
        //printf("VOUT_C ERROR\n");
        Rangeflags[6]=1;
        byte0 |= (1<<6);
    }
    // VOUT_B 故障（Bit5）
    if (statusValue & (1 << 5)) {
        //printf("VOUT_B ERROR\n");
        Rangeflags[5]=1;
        byte0 |= (1<<5);
    }
    // VOUT_A 故障（Bit4）
    if (statusValue & (1 << 4)) {
        //printf("VOUT_A ERROR\n");
        Rangeflags[4]=1;
        byte0 |= (1<<4);
    }
    // IOUT_D 故障（Bit3）
    if (statusValue & (1 << 3)) {
        //printf("IOUT_D ERR\n");
        Rangeflags[7]=1;
        byte0 |= (1<<3);
    }
    // IOUT_C 故障（Bit2）
    if (statusValue & (1 << 2)) {
        //printf("IOUT_C ERR\n");
        Rangeflags[6]=1;
        byte0 |= (1<<2);
    }
    // IOUT_B 故障（Bit1）
    if (statusValue & (1 << 1)) {
        //printf("IOUT_B ERR\n");
        Rangeflags[5]=1;
        byte0 |= (1<<1);
    }
    // IOUT_A 故障（Bit0）
    if (statusValue & (1 << 0)) {
        //printf("IOUT_A ERR\n");
        Rangeflags[4]=1;
        byte0 |= (1<<0);
    }
    
    IOLinkEventInfo[2] = byte0;
    IOLinkEventInfo[3] = byte1;
}

void UpdateIndicatorLights() {
    for (uint8_t channel = 0; channel < 9; channel++) {
        // 根据 RangeFlags 和 ErrorFlags 的状态决定指示灯模式
         uint8_t mode;
        
        if (Errorflags[channel]) {
            mode = 2;   // 有错误：快速闪烁
            //printf("CHANNEL:%d,Errorflags[channel]:%d\n",channel,Errorflags[channel]);
        } else if (Rangeflags[channel]) {
            mode = 1;     // 正常范围：常亮
            //printf("CHANNEL:%d,Rangeflags[channel]:%d\n",channel,Rangeflags[channel]);
        } else {
            mode = 0;    // 无信号：熄灭
        }
        //printf("CHANNEL:%d,MODE:%d\n",channel,mode);
        AIAOSetIndictor(channel, mode);  // 假设通道编号从1开始
    }
}

#endif


